Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: Edit Contents: Bring up a hex editor for editing the contents of memory.
ru_ru: Редактировать содержимое: вызывает шестнадцатеричный редактор для редактирования содержимого памяти.

source: If you right-click or control-click, it will display a pop-up menu for the current component below the mouse.
ru_ru: Если вы щёлкните правой кнопкой мыши или с клавишей Control, то появится всплывающее меню для текущего компонента под курсором мыши.

source: * to create AddTools for new components that can be added into the circuit.
ru_ru: * создать AddTools для новых компонентов, которые могут быть добавлены в схему.

source: Previous to deletion, the selected vertex is drawn as a diamond within the square representing the vertex.
ru_ru: Перед вставкой выделенная вершина отображается в виде ромба внутри квадрата, представляющего вершину.

source: * attributes, including one for "bit width." It's best to use those
ru_ru: * атрибуты, включая "разрядность". Лучше использовать эти

source: The bit extender transforms a value into a value of another bit width.
ru_ru: Расширитель битов преобразует значение в значение с другой разрядностью.

source: Controls the lower vertical segment on the left side.
ru_ru: Управляет нижним вертикальным сегментом на левой стороне.

source: Data: When advancing the stages, the value found at this input is loaded into the first stage.
ru_ru: Данные: при продвижении ступеней значение с этого входа загружается в первую ступень.

source: Click on the AND tool in the toolbar (, the next-to-last tool listed).
ru_ru: Нажмите на инструмент Элемент И на панели инструментов (, предпоследний инструмент в списке).

source: But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.
ru_ru: Но если вы распространяете эти части как часть целого произведения, основанного на Программе, то вы обязаны делать это в соответствии с условиями данной Лицензии, распространяя права получателей лицензии на все произведение и, таким образом, на каждую часть, вне зависимости от того, кто ее написал.

source: The leftmost input corresponds to the youngest stage.
ru_ru: Крайний левый вход соответствует младшей ступени.

source: The Table tab
ru_ru: Вкладка Таблица

source: The number of inputs is based on the Number of Inputs attribute.
ru_ru: Количество входов зависит от атрибута Количество входов.

source: Testing multiple files
ru_ru: Проверка нескольких файлов

source: Step 0: Orienting yourself
ru_ru: Шаг 0: Осваиваемся

source: But Logisim includes a handy -sub option that temporarily replace one file by another during that session — without making any changes on disk.
ru_ru: Но Logisim включает удобный параметр -sub, который временно заменяет один файл другим в ходе этой сессии - без каких-либо изменений на диске.

source: Hovering over one of the ends of a splitter will tell you the bits to which that end corresponds.
ru_ru: Наведение курсора на один из концов разветвителя скажет вам, каким битам соответствует этот конец.

source: East edge, variable number (outputs, bit width matches Data Bits attribute)
ru_ru: Восточный край, переменное количество (выходы, разрядность соответствует атрибуту Биты данных)

source: Next: User's Guide.
ru_ru: Далее: Руководство пользователя.

source: All components in Logisim define a bit width for each of input and output.
ru_ru: Все компоненты Logisim определяют разрядность для каждого входа и выхода.

source: // the invocation of painter.drawLabel to make the label be drawn.
ru_ru: // вызова painter.drawLabel чтобы сделать метку отрисованной.

source: If the Data Bits attribute is more than 1, the gate input is still a single bit, but its value is applied simultaneously to each of the source input's bits.
ru_ru: Если значение атрибута Биты данных больше единицы, то вход затвор остаётся однобитным, но значение на нём применяется одновременно к каждому биту входа исток.

source: This behavior is necessary to keep with the expected behavior of wires in Logisim.
ru_ru: Такое поведение необходимо, чтобы сохранить поведение проводов в Logisim предсказуемым.

source: I would recommend PNG files: The GIF format is quite dated, and the JPEG format will introduce artifacts into the image, as the JPEG format is really meant for photographic images.
ru_ru: Я бы порекомендовал PNG файлы: формат GIF довольно устаревшей, а формат JPEG внесёт артефакты в изображение, так как формат JPEG вообще-то предназначен для фотографических изображений.

source: The index of the split end to which bit x of the combined end corresponds.
ru_ru: Номер разделённого конца, которому соответствует бит x объединённого конца.

source: * components (even from differing factories) with the same attribute
ru_ru: * компонентов (даже из разных фабрик) с одинаковым атрибутом

source: There is no way to have two different analysis windows open at once.
ru_ru: Нет никакого способа одновременно иметь открытыми два разных окна анализа.

source: If header lines are added, then a new header line will be placed into the file whenever the selection changes.
ru_ru: Если строки заголовка добавляются, то новая строка заголовка будет помещена в файл каждый раз, когда выборка изменяется.

source: LED
ru_ru: Светодиод

source: Select, move, copy, and paste shapes.
ru_ru: Выделять, перемещать, копировать и вставлять фигуры.

source: The knob's color as it is drawn on the screen.
ru_ru: Цвет рукоятки, которым она отрисовывается на экране.

source: Next: Using subcircuits.
ru_ru: Далее: Использование подсхем.

source: Language: Change between languages.
ru_ru: Язык: Переключение между языками.

source: You can download a JAR file that allows these examples to be imported into Logisim via the Logisim Web site's Links section.
ru_ru: Вы можете скачать JAR файл, позволяющий импортировать эти примеры в Logisim, через раздел Ссылки сайта Logisim.

source: We will discuss these tabs separately, and then we will see how preferences can be configured from the command line.
ru_ru: Мы будем обсуждать эти вкладки по отдельности, а потом мы посмотрим, как настройки могут быть заданы с помощью командной строки.

source: Create a rectangle through dragging from one corner to the opposite corner.
ru_ru: Создать прямоугольник путём перетаскивания от одного угла до противоположного.

source: J-K Flip-Flop
ru_ru: J-K триггер

source: Also, the menu bar is self-explanatory.
ru_ru: Строка меню тоже не требует объяснений.

source: For some components, however, the menu has additional items.
ru_ru: Для некоторых компонентов, впрочем, меню имеет дополнительные элементы.

source: Also, if you have an existing Logisim file with a strangely configured environment, you can "reset" the environment using the Revert All To Template button in the window for editing Project Options.
ru_ru: Кроме того, если у вас есть файл Logisim со странно настроенной средой, вы можете "сбросить" среду, используя кнопку Сбросить все к шаблону в окне Параметры Проекта.

source: Next: The Project menu.
ru_ru: Далее: Меню Проект.

source: Now that we have the 4-to-1 multiplexer defined, we can now use it in other circuits.
ru_ru: Теперь у нас есть объявленный мультиплексор 4-в-1, и мы можем использовать его в других схемах.

source: Combinational analysis
ru_ru: Комбинационный анализ

source: This often arises because a gate cannot determine the proper output, perhaps because it has no inputs.
ru_ru: Это часто возникает из-за того, что элемент не может определить правильное выходное значение, или потому что ни на один вход не подано определённого значения.

source: Poking the 0 input to become 1 leads to an instantaneous 1 going into the D flip-flop, and thus the flip-flop's value will toggle every time the circuit input goes from 0 to 1.
ru_ru: Если вы нажмёте на вход чтобы изменить значение с 0 на 1, то на D триггер мгновенно придёт 1, и его значение будет переключаться каждый раз, когда значение на входе схемы меняется с 0 на 1.

source: 0 or z
ru_ru: 0 или z

source: This is a simple text label that can be placed anywhere in the circuit.
ru_ru: Это простая текстовая надпись, которая может быть размещена в любом месте схемы.

source: West edge (input, bit width according to Data Bits attribute)
ru_ru: Западный край (вход, разрядность соответствует атрибуту Биты данных)

source: Shift Type
ru_ru: Тип сдвига

source: The direction in which the pin is located relative to where the value is drawn.
ru_ru: Направление, в котором расположен контакт относительно отрисованного значения.

source: Probe
ru_ru: Датчик

source: Every component has a delay associated with it.
ru_ru: Каждый компонент имеет задержку, связанную с ним.

source: In Logisim, such a smaller circuit that is used in a larger circuit is called a subcircuit.
ru_ru: В Logisim такие меньшие схемы, использующиеся в больших схемах, называются подсхемами.

source: In "printer view", these stubs will not be drawn unless they are connected to wires.
ru_ru: При использовании "Вида для печати", эти отрезки не будут отрисованы, если не подключены к проводам.

source: The default of 1,000 is good enough for almost all purposes, even for large circuits.
ru_ru: Значение по умолчанию 1000 достаточно хорошо почти для всех целей, даже для больших схем.

source: West edge, variable number (inputs, bit width 1)
ru_ru: Западный край, переменное количество (входы, разрядность равна 1)

source: It is a particularly handy way of creating and understanding circuits with a handful of one-bit inputs and outputs.
ru_ru: Это особенно удобный способ для создания и понимания схем с несколькими однобитными входами и выходами.

source: (You can also click the far-right icon () in the explorer pane's upper toolbar.) Below, we are editing the 2:1 multiplexer's appearance so that it is drawn with the usual trapezoid rather than a rectangle.
ru_ru: (Вы также можете щёлкнуть крайний справа значок () в верхней панели инструментов панели проводника.) Ниже мы редактируем внешний вид мультиплексора 2:1 так, чтобы он отрисовывался в виде обычной трапеции вместо прямоугольника.

source: Base Library
ru_ru: Библиотека Базовые

source: A mouse press selects the wire, and a mouse drag moves it.
ru_ru: Нажатие мыши выделяет провод, а перетаскивание мыши двигает его.

source: // "delay" - the number of steps it will take for the output to update
ru_ru: // "задержка" - количество шагов, которое уйдёт на обновление выхода

source: Indicates knob's y-coordinate, whose value ranges as with the x-coordinate pin.
ru_ru: Указывает y координату рукоятки; значение находится в тех же пределах, что и для контакта x координаты.

source: The wiring tool does not itself have attributes, but the wires that it creates do.
ru_ru: Инструмент Проводка сам по себе не имеет атрибутов, но провода, которые он создаёт - имеют.

source: Logisim will make a change to the original circuit that is perhaps unexpected: The Combinational Analysis system requires that each input and output have a unique name that conforming to the rules for Java identifiers.
ru_ru: Logisim будет вносить изменения в исходную схему, возможно неожиданные: система Комбинационный анализ требует, чтобы каждый вход и выход имел уникальное имя, удовлетворяющее правилам для идентификаторов Java.

source: In our examples thus far, we've always used -tty table to indicate that a table of output values should be displayed.
ru_ru: До сих пор в наших примерах мы всегда использовали -tty table чтобы указать, что должна быть отображена таблица выходных значений.

source: Whenever the enable input is 0, the component is disabled, and the output will be all floating bits.
ru_ru: Когда на разрешающем входе 0, компонент отключен, и на выходе все биты будут плавающими.

source: By default, false is indicated by a low voltage (0) and true by a high voltage (1), but one or the other can be replaced by a high-impedance (floating) value instead.
ru_ru: По умолчанию "ложь" обозначается напряжением низкого уровня (0), а "истина" - напряжением высокого уровня (1), но одно из них может быть заменено высокоимпедансным (плавающим) значением.

source: Thus, in the Base library you'll find the Poke Tool (), the Edit Tool (), and other tools that don't correspond directly to individual components.
ru_ru: Так, в библиотеке Базовые вы найдете Инструмент Нажатие (), Инструмент Правка(), и другие инструменты, которые не связаны напрямую с конкретными компонентами.

source: If the input is an error value, then the output will also be.
ru_ru: Если на входе значение ошибки, то на выходе будет тоже оно.

source: // values and put it into the circuit state so it can be retrieved
ru_ru: // значения по умолчанию, и добавим его в состояние схемы, так что оно может быть получено

source: Output Value
ru_ru: Выходное значение

source: There are two inputs on the component's west edge.
ru_ru: Два входа на западном крае компонента.

source: Be aware, though, that any changes to a circuit's pins (adding, deleting, or moving them) will rearrange them also in the containing circuit.
ru_ru: Помните, однако, что любые изменения контактов схемы (их добавление, удаление или перемещение) переставят их и в содержащей схеме тоже.

source: Logisim includes basic support for executing circuits from the command-line.
ru_ru: Logisim включает базовую поддержку выполнения схем из командной строки.

source: A clock has only one pin, an output with a bit width of 1, whose value will represent the current value of the clock.
ru_ru: Тактовый генератор имеет всего один контакт - выход с разрядностью 1, значение на котором представляет текущее значение тактового генератора.

source: It is by Ilia Lilov, from Russia.
ru_ru: Его выполнил Илья Лилов из России.

source: T Flip-Flop: When the clock triggers, the value remembered by the flip-flop either toggles or remains the same depending on whether the T input (Toggle) is 1 or 0.
ru_ru: T триггер: когда тактовый вход срабатывает, значение, хранящееся в триггере, меняется или остаётся прежним в зависимости от того, какое значение на входе T (Переключение): 1 или 0.

source: These attributes have no effect when editing the label on an existing component, but they are imparted to any labels created using the text tool.
ru_ru: Эти атрибуты не действуют в режиме редактирования метки существующего компонента, но они действуют для любых меток, созданных с использованием Инструмента Текст.

source: For instance, you might write -tty table,halt,speed, and the program will perform all three behaviors listed below.
ru_ru: Например, вы можете написать -tty table,halt,speed, и программа осуществит все три поведения, описанных ниже.

source: Bit Width
ru_ru: Разрядность

source: If you find Logisim useful, please let me know.
ru_ru: Если вы находите Logisim полезным, пожалуйста, дайте мне знать.

source: For the purpose of our example, the query circuit has a stupid error: The carry from the half adder is not connected into the full adder.
ru_ru: Для целей нашего примера проверяемая схема имеет глупую ошибку: бит переноса из полусумматора не соединён с полным сумматором.

source: To verify our work, we'll draw it in Logisim and test it.
ru_ru: Чтобы проверить нашу работу, мы нарисуем её в Logisim и проверим её.

source: // convert it to a hex digit; if it isn't a hex digit, abort.
ru_ru: // преобразовать её в шестнадцатеричное число; если она - не шестнадцатеричное число, то отменить.

source: In addition to multiplication and addition standing for AND and OR, an expression you type may contain any of C/Java logical operators, as well as simply the words themselves.
ru_ru: В дополнение к умножению и сложению, обозначающим И и ИЛИ, выражение, которое вы набираете, может содержать любой из логических операторов C/Java, а также просто английские слова сами по себе.

source: The number of outputs for the demultiplexer will be 2selectBits.
ru_ru: Количество выходов для демультиплексора будет равно 2Выбирающие_биты.

source: The component is designed so that it can be cascaded with other adders to provide add more bits than is possible with a single adder: The carry-in input provides a one-bit value to be added into the sum also (if it is specified), and a carry-out output provides a one-bit overflow value that can be fed to another adder.
ru_ru: Компонент разработан таким образом, что его можно включать каскадно с другими сумматорами чтобы обеспечить сложение с большим количеством битов, чем возможно с одним сумматором: вход переноса предоставляет однобитное значение, которое тоже должно быть прибавлено к сумме (если оно задано), а выход переноса предоставляет однобитное значение переполнения, которое может быть подано на другой сумматор.

source: Splitter
ru_ru: Разветвитель

source: This is a minimal example illustrating the essential elements to defining a component.
ru_ru: Это минимальный пример, иллюстрирующий основные элементы для объявления компонента.

source: Many components have attributes, which are properties for configuring how the component behaves or appears.
ru_ru: Многие компоненты имеют атрибуты, являющиеся свойствами для настройки поведения или внешнего вида компонента.

source: The below illustration illustrates how this works.
ru_ru: Иллюстрация ниже показывает, как это работает.

source: Logisim's behavior when pasting the clipboard into a circuit is somewhat peculiar: It will not immediately place the components into the circuit; instead, the selection will be a collection of "ghosts," which will be dropped into the circuit as soon as they are either dragged to another location or removed from the selection.
ru_ru: Поведение Logisim при вставке из буфера обмена в схему несколько своеобразно: он не сразу поместит компоненты в схему; вместо этого выделение будет состоять из набора "призраков", которые будут добавлены в схему, как только они либо будут перетащены в другое место, либо удалены из выделения.

source: Logisim allows you to design and simulate digital circuits.
ru_ru: Logisim позволяет вам проектировать и моделировать цифровые схемы.

source: D Flip-Flop: When the clock triggers, the value remembered by the flip-flop becomes the value of the D input (Data) at that instant.
ru_ru: D триггер: когда тактовый вход срабатывает, значение, хранящееся в триггере, мгновенно становится значением входа D (Данные).

source: Tool and component attributes
ru_ru: Атрибуты инструментов и компонентов

source: Next: Generating a circuit.
ru_ru: Далее: Создание схемы.

source: (You can also right-click (or control-click) the component and choose Show Attributes from the popup menu.
ru_ru: (Можно также щёлкнуть на компоненте правой кнопкой мыши (или с зажатой клавишей Ctrl) и выбрать Показать атрибуты из контекстного меню.

source: It implements a Gray code counter where the number of bits remembered is customizable, and where the user can edit the current value by clicking on it with the Poke Tool and typing a value.
ru_ru: Он реализует счётчик кода Грея, в котором число запоминаемых битов настраивается, и в котором пользователь может изменить текущее значение, нажав на нём Инструментом Нажатие и введя значение.

source: The Free Software Foundation may publish revised and/or new versions of the General Public License from time to time.
ru_ru: Фонд Свободного ПО может время от времени публиковать пересмотренные и/или новые версии Универсальной Общественной Лицензии.

source: If yes, then the component includes inputs and outputs facilitating parallel access to all the stages' values.
ru_ru: Если Да, то компонент содержит входы и выходы для параллельного доступа к значениям всех ступеней.

source: In short, these components work as expected as long as all inputs are either 0 or 1.
ru_ru: Короче говоря, эти компоненты работают как ожидается, пока на всех входах 0 или 1.

source: The second way you can enter a subcircuit is to bring up its popup menu by right-clicking or control-clicking it, and then choosing the View option.
ru_ru: Второй способ проникнуть внутрь состояния подсхемы - вызвать всплывающее меню для подсхемы, щёлкнув правой кнопкой мыши или левой кнопкой с зажатой Control на подсхеме, и выбрав пункт "Рассмотреть".

source: The component's source input that will transmit to the output if triggered by the gate input.
ru_ru: Вход исток компонента, значение с которого будет передано на выход, если это инициировано входом затвор.

source: It may also be hidden, or it can be placed "down the middle" - that is, to the left of the canvas but to the right of the explorer pane and attribute table.
ru_ru: Она также может быть скрыта или расположена "посередине вниз" - то есть слева от холста, но справа от панели проводника и таблицы атрибутов.

source: when run, you must cause it, when started running for such
ru_ru: режиме работы, вы должны сделать так, чтобы при запуске для работы в таком

source: You can select a range of values by dragging the mouse, shift-clicking the mouse, or navigating through memory with the keyboard while depressing the shift key.
ru_ru: Вы можете выбрать диапазон значений перетаскиванием мыши, щелчком мыши с нажатой Shift, или перемещаясь по памяти с помощью клавиатуры с нажатой Shift.

source: Show Attributes: Places the component's attributes into the window's attribute table, so that the attribute values can be viewed and changed.
ru_ru: Показать атрибуты: поместить атрибуты компонента в таблицу атрибутов окна, так что значения атрибутов могут быть просмотрены и изменены.

source: This register consists of several stages, where each clock may lead to each stage receiving the value in the previous stage, while a new value is loaded into the first stage.
ru_ru: Этот регистр состоит из нескольких ступеней; каждое срабатывание тактового входа может привести к тому, что каждая ступень получит значение предыдущей ступени, а новое значение загрузится в первую ступень.

source: This is not a big deal as you're in the process of building a circuit.
ru_ru: В этом нет ничего особенного, пока вы в процессе построения схемы.

source: This sequence is of 48-bit numbers; the value seen from the component is the low-order bits as configured by its Data Bits attribute, after first throwing out the lower 12 bits of the current seed.
ru_ru: Эта последовательность состоит из 48-битных чисел; значение на выходе компонента - это младшие биты, количество которых выбрано в атрибуте Биты данных, но после отбрасывания младших 12 битов текущего семени.

source: When you choose Print..., Logisim displays a dialog box for configuring what is printed.
ru_ru: Когда вы выбираете Печать..., Logisim отображает диалоговое окно для настройки того, что печатается.

source: The clipboard can be transferred to any application supporting tab-delimited text (such as a spreadsheet).
ru_ru: Буфер может быть перенесён в любое другое приложение, поддерживающее текст, разделённый символами табуляции (например, в электронную таблицу).

source: Any attempt otherwise to copy, modify, sublicense or distribute the Program is void, and will automatically terminate your rights under this License.
ru_ru: Любая попытка копировать, изменять, повторно лицензировать, или распространять Программу каким-либо другим способом неправомерна и автоматически прекращает ваши права данные вам этой Лицензией.

source: This normally leads the wire coming from the controlled buffer to be blue; but here it is dark green because the floating output combines through the tunnel with the 0 from the pin at bottom.
ru_ru: Обычно это заставляет провод, выходящий из управляемого буфера, быть синим; но здесь он тёмно-зелёный, потому что плавающее значение на выходе совмещается через тоннель с 0 от контакта внизу.
